backend/controllers/TaskLogController.php

    public function actionCreate()
    {
        $model = new TaskLog();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `task_log` (`task_id`, `description`, `completion`, `created`, `created_by`, `changed`, `changed_by`) VALUES (1, 'Muudatus', 10, '1', 1, '1', 1)

    protected function findModel($id)
    {
        if (($model = TaskLog::findOne($id)) !== null) {
---
SELECT * FROM `task_log` WHERE `id`='1'