backend/controllers/TaskController.php

INSERT INTO `task` (`name`, `description`, `start_date`, `due_date`, `responsible`, `location`, `machine`, `priority`, `completion`, `today`, `created`, `created_by`, `changed`, `changed_by`) VALUES ('TEST 1', 'fkdlsöakflösda\r\nfds\r\naf\r\ndsa\r\nfd\r\nsa', '12.07.2016', '15.07.2016', 1, 'Metsas', 'pole', 10, 5, 1, '201312.3212', 1, '312', 1)
---
    public function actionCreate()
    {
        $model = new Task();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `task` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Task::findOne($id)) !== null) {